Revit 2027 API
IFCExtrusionCreationData.HasExtrusionDirection Property
 Identifies if the data contains a extrusion direction.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasExtrusionDirection { get; }
Public ReadOnly Property HasExtrusionDirection As Boolean
	Get
public:
property bool HasExtrusionDirection {
	bool get ();
}
member HasExtrusionDirection : bool with get
Property Value
Boolean
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace